app/controllers/main_controller.rb

SELECT "estudiantes".* FROM "estudiantes"
INSERT INTO "estudiantes" ("nombre", "definitiva", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nombre", "Felipe Montoya"], ["definitiva", 5.0], ["created_at", 2017-02-04 16:00:59 UTC], ["updated_at", 2017-02-04 16:00:59 UTC]]
---
  def show_data
    @estudiantes = Estudiante.all
    @name = params[:name_user]
    @note1 = params[:note_1]
    @per1 = params[:per_1]
    @note2 = params[:note_2]
    @per2 = params[:per_2]
    @note3 = params[:note_3]
    @per3 = params[:per_3]
    @avg = (((@note1.to_i) * (@per1.to_f/100)) + ((@note2.to_i) * (@per2.to_f/100)) + ((@note3.to_i) * (@per3.to_f/100)))/10
    @estudiante = Estudiante.new(:nombre => @name, :definitiva =>@avg)
    @estudiante.save